tutorials/immersedBoundary/cylinderInChannelPotential/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
    // p
    // {
    //     solver          amgSolver;
    //     cycle           W-cycle;
    //     policy          SAMG;
    //     groupSize       2;
    //     minGroupSize    2;
    //     maxGroupSize    4;

    //     nPreSweeps      2;
    //     nPostSweeps     2;
    //     minCoarseEqns   4;
    //     nMaxLevels      100;
    //     scale           on;
    //     smoother        ILUC0;

    //     minIter         0;
    //     maxIter         100;
    //     tolerance       1e-7;
    //     relTol          0.0;
    // }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;

    pRefPoint (0 -0.45 0.05);
    pRefValue 0;
}

PISO
{
    nOuterCorrectors 1;
    nCorrectors     3;
    nNonOrthogonalCorrectors 0;

    pRefPoint (0 -0.45 0.0);
    pRefValue 0;
}


// ************************************************************************* //
